ak_tag_color_map = {
    "作战": "#9a41e5",
    "紧急作战": "#85342d",
    "险路恶敌": "#b7301e",
    "不期而遇": "#14bec0",
    "安全的角落": "#00a1e9",
    "兴致盎然": "#14bec0",
    "命运所指": "#14bec0",
    "得偿所愿": "#1a9358",
    "诡意行商": "#1a9358",
    "误入其境": "#e241e5",
    "出园": "#1a9358",
    "次日": "#1a9358"
}

ak_tag_icon_map = {
    "作战": "battle",
    "紧急作战": "battle",
    "险路恶敌": "boss",
    "不期而遇": "flower",
    "安全的角落": "tower",
    "兴致盎然": "dice",
    "命运所指": "dialog",
    "得偿所愿": "coin",
    "诡意行商": "box",
    "误入其境": "spiral",
    "出园": "exit",
    "次日": "next"
}